# Statistics
army = 'Армия:'
budget = 'Бюджет:'
loyalty = 'Лояльность:'
tech = 'Наука:'
ecology = 'Экология:'

# Interface buttons
menu_head = 'Главное меню'
start_game = 'Начать игру'
lose_to_menu = 'Ура!'
back_to_menu = 'Вернуться в главное меню'
game_quit = 'Выйти из игры'

# Ingame text
loser_text = 'Вы проиграли'
winner_text = 'Поздравляем! Вы стали лучшим правителем всех времён!'

# Quests
quest_spy = 'Министр докладывает, что один из ваших приближенных в армии может' \
    ' быть шпионом, который сливает наши наработки другому государству,' \
    ' так как он постоянно забирает с собой рабочий ноутбук. Казнить его?'

quest_farmers = 'Фермеры докладывают о небывалом урожае, куда пустить его.'

quest_high_water = 'Министр докладывает что река Егося разлилась из-за' \
    ' весеннего половодья и затопит деревню. Отправить армию на разбивание льда?'

quest_wedding = 'Диктатор Волков предлагает заключить перемирие старинным методом:' \
    ' провести свадьбу Вашего сына на его дочери. Согласны на свадьбу?'

quest_scientist = 'Учёный Карпенко предлагает авантюрную идею, добывать' \
    ' обеднённый уран на берегу реки Егося. Рискнёте?'

quest_rallies = 'Граждане вышли на улицу из-за убийства полицией гражданина' \
    ' страны при задержании. Сделать полицейскую реформу по ограничению прав полиции?'

quest_escape = 'Из тюрьмы с особо опасными преступниками сбежало 30 заключённых.' \
    ' Отправить армию на их поимку?'

quest_homeless = 'В вашей стране проблема с бездомными собаками,' \
    ' которые периодически убивают детей и колечут граждан. Решать проблему?'

quest_earthquake = 'В вашей стране прошла череда сильных землетрясений.' \
    ' В пострадавших городах началось мародёрство, а под завалами остались люди,' \
    ' но в службах нехватка людей. Что делать?'

quest_strike = 'Рабочие на заводах вышли на забастовку с требованием' \
    ' повышения зарплаты. Повысить зарплату?'

quest_minerals = 'Месторождение фосфора исчерпалось, из-за чего дальнейшие' \
    'дальнейшие научные исследования невозможны. Начать добывать фосфор' \
    'в месте, где это навредит природе?'


# Answers on quests
quest_answer_spy_1 = 'Казнить.'
quest_answer_spy_2 = 'Помиловать.'

quest_answer_farmers_1 = 'Накормить народ.'
quest_answer_farmers_2 = 'Продать другим странам.'

quest_answer_high_water_1 = 'Отправить армию'
quest_answer_high_water_2 = 'Не обращать внимание.'

quest_answer_wedding_1 = 'Согласиться.'
quest_answer_wedding_2 = 'Отказаться.'

quest_answer_scientist_1 = 'Рискнуть.'
quest_answer_scientist_2 = 'Не рисковать.'

quest_answer_rallies_1 = 'Сделать реформу.'
quest_answer_rallies_2 = 'Ничего не делать.'

quest_answer_escape_1 = 'Отправить армию.'
quest_answer_escape_2 = 'Ничего не делать.'

quest_answer_homeless_1 = 'Начать поимку бездомных животных.'
quest_answer_homeless_2 = 'Сделать вид, что проблемы нет.'

quest_answer_earthquake_1 = 'Прекратить мародёрство.'
quest_answer_earthquake_2 = 'Начать поиск выживших и помогать пострадавшим.'

quest_answer_strike_1 = 'Повысить зарплату.'
quest_answer_strike_2 = 'Не повышать зарплату.'

quest_answer_minerals_1 = 'Начать добычу фосфора.'
quest_answer_minerals_2 = 'Искать другие решения.'


# Quests results
quest_anw_spy = 'Ваш приближенный забирал ноутбук домой, чтобы работать оттуда,' \
    ' у него болел ребёнок, он не был шпионом.'
