# Statistics
army = 'Армия:'
budget = 'Бюджет:'
loyalty = 'Лояльность:'
tech = 'Наука:'
ecology = 'Экология:'

# Interface buttons
menu_head = 'Главное меню'
start_game = 'Начать игру'
lose_to_menu = 'Ура!'
back_to_menu = 'Вернуться в главное меню'
game_quit = 'Выйти из игры'

# Ingame text
loser_text = 'Вы проиграли'
winner_text = 'Поздравляем! Вы стали лучшим правителем всех времён!'

# Quests
quest_spy = 'Министр докладывает, что один из ваших приближенных в армии может' \
    ' быть шпионом, который сливает наши наработки другому государству,' \
    ' так как он постоянно забирает с собой рабочий ноутбук. Казнить его?'

quest_farmers = 'Фермеры докладывают о небывалом урожае, куда пустить его.'

quest_high_water = 'Министр докладывает что река Егося разлилась из-за' \
    ' весеннего половодья и затопит деревню. Отправить армию на разбивание льда?'

quest_wedding = 'Диктатор Волков предлагает заключить перемирие старинным методом:' \
    ' провести свадьбу Вашего сына на его дочери. Согласны на свадьбу?'

quest_scientist = 'Учёный Карпенко предлагает авантюрную идею, добывать' \
    ' обеднённый уран на берегу реки Егося. Рискнёте?'

quest_rallies = 'Граждане вышли на улицу из-за убийства полицией гражданина' \
    ' страны при задержании. Сделать полицейскую реформу по ограничению прав полиции?'

quest_escape = 'Из тюрьмы с особо опасными преступниками сбежало 30 заключённых.' \
    ' Отправить армию на их поимку?'

quest_homeless = 'В вашей стране проблема с бездомными собаками,' \
    ' которые периодически убивают детей и колечут граждан. Решать проблему?'

quest_earthquake = 'В вашей стране прошла череда сильных землетрясений.' \
    ' В пострадавших городах началось мародёрство, а под завалами остались люди,' \
    ' но в службах нехватка людей. Что делать?'

quest_strike = 'Рабочие на заводах вышли на забастовку с требованием' \
    ' повышения зарплаты. Повысить зарплату?'

quest_minerals = 'Месторождение фосфора исчерпалось, из-за чего дальнейшие' \
    'дальнейшие научные исследования невозможны. Начать добывать фосфор' \
    'в месте, где это навредит природе?'

quest_evgeny_rat = 'В мире поднялась стоимость шкуры жекакрысов, который является вымирающим видом. Продавать шкуру?'

quest_trees = 'Ученным необходимо вырубить деревья колянусы, необходимые в науке, ' \
    ' что может сильно повлиять на экологию. Вырубать деревья?'

quest_education = ' Население требует улучшения образования и науки. ' \
    ' Инвестировать в образование и науку?'

quest_elections = 'В вашей стране раз в 6 лет проходят выборы и впервые' \
    ' был допущен оппозиционный кандидат Иван Поповоглу который пользуется ' \
    ' значительной поддержкой народа.'

quest_refugees = ' Из соседней страны с юга большой поток беженцев из-за кризиса,' \
    ' беженцам не рады радикальные религиозные группировки с юга,' \
    ' но стране необходима дешёвая рабочая сила.'

quest_racism = ' Местные этнические меньшинства чувствуют притеснения со стороны' \
    ' этнического большинства. Принять законы против притеснений на расовой почве?'

quest_drugs = ' Из вашей страны поступает большое количество наркотиков,' \
    ' производящихся на севере страны, в соседние страны.' \
    ' Объявить войну наркокартелям?'

quest_healthcare = 'В вашей стране граждане недовольны здравоохранением.' \
    ' Выделить бюджет на решение проблемы?'

quest_sanctions = ' Демократические страны грозятся серьезными санкциями, если' \
    ' вы не закроете экономически важные предприятия загрязняющие природу.' \
    ' Закрыть предприятия?'

quest_gold = ' Главный шахтёр Адыбек сообщает об огромной жиле золота,' \
    ' но она находиться под очень твёрдой породой, что нам сделать с этим золотом?'



# Answers on quests
quest_answer_spy_1 = 'Казнить.'
quest_answer_spy_2 = 'Помиловать.'

quest_answer_farmers_1 = 'Накормить народ.'
quest_answer_farmers_2 = 'Продать другим странам.'

quest_answer_high_water_1 = 'Отправить армию'
quest_answer_high_water_2 = 'Не обращать внимание.'

quest_answer_wedding_1 = 'Согласиться.'
quest_answer_wedding_2 = 'Отказаться.'

quest_answer_scientist_1 = 'Рискнуть.'
quest_answer_scientist_2 = 'Не рисковать.'

quest_answer_rallies_1 = 'Сделать реформу.'
quest_answer_rallies_2 = 'Ничего не делать.'

quest_answer_escape_1 = 'Отправить армию.'
quest_answer_escape_2 = 'Ничего не делать.'

quest_answer_homeless_1 = 'Начать поимку бездомных животных.'
quest_answer_homeless_2 = 'Сделать вид, что проблемы нет.'

quest_answer_earthquake_1 = 'Прекратить мародёрство.'
quest_answer_earthquake_2 = 'Начать поиск выживших и помогать пострадавшим.'

quest_answer_strike_1 = 'Повысить зарплату.'
quest_answer_strike_2 = 'Не повышать зарплату.'

quest_answer_minerals_1 = 'Начать добычу фосфора.'
quest_answer_minerals_2 = 'Искать другие решения.'

quest_answer_evgeny_rat_1 = 'продавать шкуру'
quest_answer_evgeny_rat_2 = 'сохранить вид'

quest_answer_trees_1 = 'Да'
quest_answer_trees_2 = 'Нет'

quest_answer_education_1 = 'Да'
quest_answer_education_2 = 'Нет'

quest_answer_elections_1 = 'Посадить Поповоглу'
quest_answer_elections_2 = 'Позволить участвовать в выборах'

quest_answer_refuges_1 = 'Депортировать беженцев из страны'
quest_answer_refuges_2 = 'Оставить'

quest_answer_rasism_1 = 'Да'
quest_answer_rasism_2 = 'Нет'

quest_answer_drugs_1 = 'Да'
quest_answer_drugs_2 = 'Нет'

quest_answer_healthcare_1 = 'Да'
quest_answer_healthcare_2 = 'Нет'

quest_answer_sanctions_1 = 'Да'
quest_answer_sanctions_2 = 'Нет'

quest_answer_gold_1 = 'Позвать армию и взорвать эту породу'
quest_answer_gold_2 = 'купить шахтёрам новое оборудование'

# Quests results
quest_anw_spy = 'Ваш приближенный забирал ноутбук домой, чтобы работать оттуда,' \
    ' у него болел ребёнок, он не был шпионом.'
